# KipsPerSquareInch Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..KipsPerSquareInch Property
UnitTypeId Class See Also
---
Kips per square inch.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId KipsPerSquareInch { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property KipsPerSquareInch As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ KipsPerSquareInch {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace